common/xrd-automated-tests/mock/queries_asa/testservice_xroadGetRandom_TS2OWNER_sub.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
xmlns:id="http://x-road.eu/xsd/identifiers"
xmlns:ns1="http://producer.x-road.eu">
   <soapenv:Header>
      <xrd:protocolVersion>4.0</xrd:protocolVersion>
      <xrd:issue>12345</xrd:issue>
      <xrd:userId>EE12345678901</xrd:userId>
      <xrd:id>{uuid}</xrd:id>
      <xrd:service id:objectType="SERVICE">
         <id:xRoadInstance>KS1</id:xRoadInstance>
         <id:memberClass>COM</id:memberClass>
         <id:memberCode>CLIENT1</id:memberCode>
         <!--Optional:-->
         <id:subsystemCode>testservice</id:subsystemCode>
         <id:serviceCode>xroadGetRandom</id:serviceCode>
         <!--Optional:-->
         <id:serviceVersion>v1</id:serviceVersion>
      </xrd:service>
      <xrd:client id:objectType="MEMBER">
         <id:xRoadInstance>KS1</id:xRoadInstance>
         <id:memberClass>GOV</id:memberClass>
         <id:memberCode>TS2OWNER</id:memberCode>
         <!--Optional:-->
         <id:subsystemCode>sub</id:subsystemCode>
      </xrd:client>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:xroadGetRandom>
         <request>
             <seed>100</seed>
         </request>
      </ns1:xroadGetRandom>
   </soapenv:Body>
</soapenv:Envelope>